In [ ]:
def fun(company_name,url):
    result=False
    words_company_name=company_name.split(sep=' ')   
    for word in words_company_name:
        found= re.search(word, url)
        if found:
            result=True
    return result         
    
df['result']= df.apply(lambda x: fun(x.slowo,x.adres2), axis=1)
df

In [21]:
import pandas as pd
import numpy as np

df=pd.read_excel('people.xlsx')
df

        name sex location  height  weight  income
0  Johannnes   M      GER     175      84    30.0
1      Marie   F       FR     160      50    50.0
2   Victoria   F       UK     164      54     NaN
3       Adam   M       UK     190      92     NaN
4        Ken   M       UK     184      88    30.0
5      Jonas   M      GER     184      88    40.0
6     Pierre   M       FR     190     100     NaN

In [54]:
groups=df.groupby(['location'])
res=groups.sex.count().reset_index()
groups.apply(lambda x: x['weight'].mean()/x['height'].mean())

location
FR     0.428571
GER    0.479109
UK     0.434944
dtype: float64